Revit 2027 API
EquipmentClassification Enumeration
 This enumeration is used to classify the mechanical equipment.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum EquipmentClassification
Public Enumeration EquipmentClassification
public enum class EquipmentClassification
type EquipmentClassification
Members
Member name | Value | Description
None | 0 |  The undefined equipment type.
Pump | 5 |  The pump equipment.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace